phuthuycoding/sol-evc-firmware/esp8266-wifi/include/drivers/network/wifi_manager.h
/**
 * @file wifi_manager.h
 * @brief WiFi Manager (ESP8266 optimized - without WiFiManager library)
 * @version 3.0.0
 */

#ifndef WIFI_MANAGER_H
#define WIFI_MANAGER_H

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include "../config/unified_config.h"

/**
 * @brief WiFi error codes
 */
enum class WiFiError : int8_t {
    SUCCESS = 0,
    NOT_CONFIGURED = -1,
    CONNECTION_FAILED = -2,
    TIMEOUT = -3,
    ALREADY_CONNECTED = -4
};

/**
 * @brief WiFi status
 */
struct WiFiStatus {
    bool connected;
    bool apMode;
    int8_t rssi;
    IPAddress ipAddress;
    IPAddress gateway;
    uint32_t connectTime;
    uint32_t disconnectCount;
    char ssid[32];
};

/**
 * @brief Custom WiFi Manager (native implementation)
 */
class CustomWiFiManager {
private:
    const DeviceConfig& config;
    WiFiStatus status;
    uint32_t lastReconnectAttempt;

    static constexpr uint32_t RECONNECT_INTERVAL = 30000;

    void updateStatus();

public:
    explicit CustomWiFiManager(const DeviceConfig& cfg);

    WiFiError init();
    WiFiError connect();
    WiFiError connectToNetwork(const char* ssid, const char* password);
    void disconnect();
    WiFiError startAPMode();
    void handle();

    bool isConnected() const;
    bool isAPMode() const { return status.apMode; }
    const WiFiStatus& getStatus() const { return status; }

    // Prevent copying
    CustomWiFiManager(const CustomWiFiManager&) = delete;
    CustomWiFiManager& operator=(const CustomWiFiManager&) = delete;
};

#endif // WIFI_MANAGER_H
